---
title: AssetPropertyList
classe: Autodesk.Revit.DB.Visual.AssetPropertyList
namespace: Autodesk.Revit.DB.Visual
eredita: Autodesk.Revit.DB.Visual.AssetProperty
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 10
---

# AssetPropertyList

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Void AddNewAssetAsColor(Color)` | `assetPropertyList.AddNewAssetAsColor(value)` | Void |
| `Void AddNewAssetPropertyDouble(Double)` | `assetPropertyList.AddNewAssetPropertyDouble(value)` | Void |
| `Void AddNewAssetPropertyInteger(Int32)` | `assetPropertyList.AddNewAssetPropertyInteger(value)` | Void |
| `IList<AssetProperty> GetValue()` | `assetPropertyList.GetValue()` | IList<AssetProperty> |
| `Void InsertNewAssetAsColor(Color, Int32)` | `assetPropertyList.InsertNewAssetAsColor(value, index)` | Void |
| `Void InsertNewAssetPropertyDouble(Double, Int32)` | `assetPropertyList.InsertNewAssetPropertyDouble(value, index)` | Void |
| `Void InsertNewAssetPropertyInteger(Int32, Int32)` | `assetPropertyList.InsertNewAssetPropertyInteger(value, index)` | Void |
| `Boolean IsValidValue(IList<AssetProperty>)` | `assetPropertyList.IsValidValue(value)` | Boolean |
| `Void RemoveAssetProperty(Int32)` | `assetPropertyList.RemoveAssetProperty(index)` | Void |
| `Void SetValue(IList<AssetProperty>)` | `assetPropertyList.SetValue(value)` | Void |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```